documents/images/graphio/bxdf/lama_mix_bsdf.dot
digraph {
  rankdir = LR;
    NG_lama_mix_bsdf_mix [label= "mix"];
    NG_lama_mix_bsdf_mix[shape = box];
    NG_lama_mix_bsdf_mix ->     NG_lama_mix_bsdf_out;
    NG_lama_mix_bsdf_out [label= "out"];
    NG_lama_mix_bsdf_out[shape = box]; 
    NG_lama_mix_bsdf_material2INT [label="material2"];
    NG_lama_mix_bsdf_material2INT [shape = ellipse];
    NG_lama_mix_bsdf_mix [label="mix"];
    NG_lama_mix_bsdf_material2INT -> NG_lama_mix_bsdf_mix [label=".fg"];
    NG_lama_mix_bsdf_material1INT [label="material1"];
    NG_lama_mix_bsdf_material1INT [shape = ellipse];
    NG_lama_mix_bsdf_mix [label="mix"];
    NG_lama_mix_bsdf_material1INT -> NG_lama_mix_bsdf_mix [label=".bg"];
    NG_lama_mix_bsdf_mixINT [label="mix"];
    NG_lama_mix_bsdf_mixINT [shape = ellipse];
    NG_lama_mix_bsdf_mix [label="mix"];
    NG_lama_mix_bsdf_mixINT -> NG_lama_mix_bsdf_mix [label=".mix"];
}
